from configs.config import NICKNAME

# 实用
utility_help = {
    "update_pic": "一些对图片的操作 --> 指令:操作图片/图片/修改图片（包含 10 种图片操作）",
    "songpicker2": "来一首歌听听？ --> 指令:点歌",
    "translate": "出国旅游助手(狗头) --> 指令:英翻/翻英/日翻/翻日/韩翻/翻韩",
    "cover": "快捷的b站封面获取方式 --> 指令:b封面 [连接/av/bv/cv/直播id]",
}
# 娱乐
entertainment_help = {
    "sign_in": "签到(影响色图和开箱) --> 指令:签到/我的签到/好感度排行/好感度总榜/好感度总榜[屏蔽我/显示我]",
    "send_img": "发送图片 --> 指令:美图/萝莉/壁纸/(美图/萝莉/壁纸[id])/N张图xx(N<=9)",
    "send_setu": "不要小看涩图啊混蛋！ --> 指令:色图/色图[id]/n张色图/n张xx色图/查色图/...（请查看 色图 帮助）",
    "white2black_img": "黑白草图 --> 指令:黑白图/黑白草图",
    "poke": "戳一戳发送语音美图萝莉图不美哉？",
    "luxun": "鲁迅说过 --> 指令:鲁迅说",
    "fake_msg": "构造一个假消息 --> 指令:假消息",
    "shop_handle": "商店系统(初始送100金币) --> 指令:商店/我的金币/购买道具/使用道具",
    "nickname": "区区昵称！ --> 指令:以后叫我xx(昵称)/我是谁/取消昵称",
    "russian": "紧张刺激的俄罗斯轮盘 --> 指令:俄罗斯轮盘帮助",
    "gold_redbag": f"运气项目又来啦！ --> 指令:塞红包/ 抢红包指令: 开/抢/戳一戳{NICKNAME}/ 退回:退回未抢完的红包",
    "bilibili_sub": f"非常快捷的订阅播报 --> 指令:添加订阅 [主播/up/番剧] [id/番名/链接] / 删除订阅 [id]/ 查看订阅"
}
# 其他
other_help = [
    "查看当前的群欢迎消息 --> 指令:群欢迎消息",
    "这是一份正经的自我介绍 --> 指令:自我介绍",
    "不得看看自己权力多大？ --> 指令:我的权限",
    "有人记得你是什么时候加入我们的 --> 指令:我的信息",
    "让我看看更新了什么 --> 指令:更新信息",
    f"{NICKNAME}给我把话收回去！ --> 指令:撤回 [id](默认0)",
    "群拥有的权限 --> 指令:查看群权限",
    "数据统计可视化_1 --> 指令:功能调用统计/日功能调用统计/周功能调用统计/月功能调用统计",
    "数据统计可视化_2 --> 指令:周功能调用统计 [功能名称]/月功能调用统计 [功能名称]",
]
